# 数据挖掘与数据仓库 实验二 段晶晶 2020.4.2

# 设置工作空间
setwd("C://Users//Jayce//Documents//RStudioWorkspace//sjwjprj02")

# (1). 使用R语言定义两个向量x1 = (2, 4, 6, 8, 0)；x2 = (1, 3, 5, 7, 9)
x1 = c(2, 4, 6, 8, 0)
x2 = c(1, 3, 5, 7, 9)
# (2). 查看x1，x2的长度和类型。
length(x1)
length(x2)
typeof(x1)
typeof(x2)
# (3). 将x1，x2按行组合，按列组合。
rbind(x1,x2)
cbind(x1,x2)
# (4). 引用x1的第2，3个分量。
x1[2:3]
# (5). 计算x1的平均值、求和、最大值和最小值。
mean(x1)
sum(x1)
max(x1)
min(x1)
# (6). 计算x2的方差、标准差、连乘。
var(x2)
sd(x2)
prod(x2)
# (7). 返回x1最小分量的下标。
which.min(x1)
# (8). 将x1的分量由大到小排序。
sort(x1)
# (9). 定义向量x3，x3是x1和x2分量的依次组合。（x3 = (2, 4, 6, 8, 0, 1, 3, 5, 7, 9)）
x3 = c(2, 4, 6, 8, 0, 1, 3, 5, 7, 9)
x3=c(x1,x2)
x3
# 2. 矩阵的定义与操作
# (1). 使用R语言，从向量x3产生两个均为2行5列的矩阵X1和X2，其中X1为默认情况赋值，X2为按行赋值。
x1=matrix(x3,nrow=2,ncol=5)
x1
x2=matrix(x3,nrow=2,ncol=5,byrow = T)
x2
# (2). 分别输出X1，X2的转置矩阵X3，X4。
x3=t(x1)
x3
x4=t(x2)
x4
# (3). 输出X3与X4相加的结果。
x3+x4
# (4). 输出X1与X4相乘的结果；输出X3与X2相乘的结果。
x1 %*% x4

x3 %*% x2
